Revit 2027 API
Checker.TextureRealWorldScaleX Property
 The property labeled "Size X" from the "Checker" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string TextureRealWorldScaleX { get; }
Public Shared ReadOnly Property TextureRealWorldScaleX As String
	Get
public:
static property String^ TextureRealWorldScaleX {
	String^ get ();
}
static member TextureRealWorldScaleX : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDistance" with a minimum of "0.01".
See Also
Reference
Checker Class
Autodesk.Revit.DB.Visual Namespace